clc;clear;

x1(1,1)=2.1418;x1(1,2)=0.5950;x1(2,1)=0.5519;x1(2,2)=0.5091;
x1(3,1)=1.3836;x1(3,2)=1.8033;x1(4,1)=1.2419;x1(4,2)=2.7278;
x1(5,1)=0.4427;x1(5,2)=2.8981;x1(6,1)=2.2427;x1(6,2)=2.5981;

x2(1,1)=2.7302;x2(1,2)=4.5080;x2(2,1)=3.8067;x2(2,2)=4.5319;
x2(3,1)=3.1664;x2(3,2)=4.0801;x2(4,1)=2.9686;x2(4,2)=6.0172;
x2(5,1)=4.0973;x2(5,2)=4.0559;x2(6,1)=2.4755;x2(6,2)=4.9869;

x3(1,1)=4.7302;x3(1,2)=0.5080;x3(2,1)=5.8067;x3(2,2)=2.1319;
x3(3,1)=6.1664;x3(3,2)=2.2801;x3(4,1)=4.9686;x3(4,2)=1.0172;
x3(5,1)=5.0973;x3(5,2)=2.4559;x3(6,1)=6.4755;x3(6,2)=2.1869;
figure(1);hold on;plot(x1(:,1),x1(:,2),'*',x2(:,1),x2(:,2),'o',x3(:,1),x3(:,2),'+');hold off

x1(:,3)=1;x2(:,3)=1;x3(:,3)=1;
p=0.6;s = true;n=1;%p为迭代步长
w1=[0;0;0];w2=[0;0;0];w3=[0;0;0];ws=[0;0;0];

while s
    %仅在分类错误时对更改权向量，进行惩罚
    for i=1:length(x1)
        if (x1(i,:)*w1 <= x1(i,:)*w2)
            w1 = w1+p*x1(i,:)';w2 = w2-p*x1(i,:)';ws = ws+x1(i,:)';end
        if (x1(i,:)*w1 <= x1(i,:)*w3)
            w1 = w1+p*x1(i,:)';w3 = w3-p*x1(i,:)';ws = ws+x1(i,:)';end
    end
    
    for i=1:length(x2)
        if (x2(i,:)*w2 <= x2(i,:)*w1)
            w2 = w2+p*x2(i,:)';w1 = w1-p*x2(i,:)';ws = ws+x2(i,:)';end
        if (x2(i,:)*w2 <= x2(i,:)*w3)
            w2 = w2+p*x2(i,:)';w3 = w3-p*x2(i,:)';ws = ws+x2(i,:)';end
    end
    for i=1:length(x3)
        if (x3(i,:)*w3 <= x3(i,:)*w1)
            w3 = w3+p*x3(i,:)';w1 = w1-p*x3(i,:)';ws = ws+x3(i,:)';end
        if (x3(i,:)*w3 <= x3(i,:)*w2)
            w3 = w3+p*x3(i,:)';w2 = w2-p*x3(i,:)';ws = ws+x3(i,:)';end
    end
    if (ws == [0;0;0]) s = false; %#ok<*SEPEX>
    else n = n + 1;ws = [0;0;0];end
end

F1 = @(x,y) w1(1)*x+w1(2)*y+w1(3);
F2 = @(x,y) w2(1)*x+w2(2)*y+w2(3);
F3 = @(x,y) w3(1)*x+w3(2)*y+w3(3);
hold on;fimplicit(F1,'r');fimplicit(F2,'g');fimplicit(F3,'b');hold off;
axis([0,12,0,6]);

input_args(1,3)=1;
[vmax,index] = max([input_args*w1,input_args*w2,input_args*w3]);
disp(strcat('w',num2str(index)))